Repository: verseles/dash-for-cloudflare
Catalog: lib/l10n/app_*.arb
Languages: pt, zh

# debugLogs_title
source: Debug Logs
pt: Logs de Depuração
zh: 调试日志

# debugLogs_copyAll
source: Copy All
pt: Copiar Tudo
zh: 全部复制

# debugLogs_saveToFile
source: Save to File
pt: Salvar em Arquivo
zh: 保存到文件

# debugLogs_shareAsText
source: Share as Text
pt: Compartilhar Texto
zh: 以文本分享

# debugLogs_shareAsFile
source: Share as File
pt: Compartilhar Arquivo
zh: 以文件分享

# debugLogs_clearLogs
source: Clear Logs
pt: Limpar Logs
zh: 清除日志

# debugLogs_logsCopied
source: Logs copied to clipboard
pt: Logs copiados
zh: 日志已复制到剪贴板

# debugLogs_savedTo
source: Saved to {path}
pt: Salvo em {path}
zh: 已保存到 {path}

# debugLogs_failedToSave
source: Failed to save: {error}
pt: Falha ao salvar: {error}
zh: 保存失败：{error}

# debugLogs_failedToShare
source: Failed to share: {error}
pt: Falha ao compartilhar: {error}
zh: 分享失败：{error}

# debugLogs_copyTimeRange
source: Copy {timeRange}
pt: Copiar {timeRange}
zh: 复制 {timeRange}

# debugLogs_logEntryCopied
source: Log entry copied
pt: Log copiado
zh: 日志条目已复制

# debugLogs_timeRange
source: Time Range:
pt: Período:
zh: 时间范围：

# debugLogs_filter
source: Filter:
pt: Filtro:
zh: 筛选：

# debugLogs_entries
source: {count} entries
pt: {count} entradas
zh: {count} 条记录

# debugLogs_noLogsInRange
source: No logs in this time range
pt: Sem logs neste período
zh: 此时间范围内没有日志

# debugLogs_tryLongerRange
source: Try selecting a longer time range
pt: Tente um período maior
zh: 请尝试选择更长的时间范围

# debugLogs_autoScrollOn
source: Auto-scroll ON
pt: Auto-scroll LIGADO
zh: 自动滚动：开

# debugLogs_autoScrollOff
source: Auto-scroll OFF
pt: Auto-scroll DESLIGADO
zh: 自动滚动：关

# dnsRecord_createTitle
source: Create DNS Record
pt: Criar Registro DNS
zh: 创建 DNS 记录

# dnsRecord_editTitle
source: Edit DNS Record
pt: Editar Registro DNS
zh: 编辑 DNS 记录

# dnsRecord_recordCreated
source: Record created
pt: Registro criado
zh: 记录已创建

# dnsRecord_recordUpdated
source: Record updated
pt: Registro atualizado
zh: 记录已更新

# dnsRecord_ttlAuto
source: Auto
zh: 自动

# dnsRecord_ttl2min
source: 2 minutes
pt: 2 minutos
zh: 2 分钟

# dnsRecord_ttl5min
source: 5 minutes
pt: 5 minutos
zh: 5 分钟

# dnsRecord_ttl10min
source: 10 minutes
pt: 10 minutos
zh: 10 分钟

# dnsRecord_ttl15min
source: 15 minutes
pt: 15 minutos
zh: 15 分钟

# dnsRecord_ttl30min
source: 30 minutes
pt: 30 minutos
zh: 30 分钟

# dnsRecord_ttl1hour
source: 1 hour
pt: 1 hora
zh: 1 小时

# dnsRecord_ttl2hours
source: 2 hours
pt: 2 horas
zh: 2 小时

# dnsRecord_ttl5hours
source: 5 hours
pt: 5 horas
zh: 5 小时

# dnsRecord_ttl12hours
source: 12 hours
pt: 12 horas
zh: 12 小时

# dnsRecord_ttl1day
source: 1 day
pt: 1 dia
zh: 1 天

# dnsRecord_enterValue
source: Enter value
pt: Insira o valor
zh: 输入值

# emptyState_noResultsFor
source: No results for "{query}"
pt: Nenhum resultado para "{query}"
zh: 没有“{query}”的结果

# emptyState_tryAdjustingSearch
source: Try adjusting your search terms
pt: Tente ajustar seus termos de busca
zh: 尝试调整搜索条件

# pages_selectAccount
source: Select account
pt: Selecionar conta
zh: 选择账号

# pages_noProjects
source: No Pages projects found
pt: Nenhum projeto Pages encontrado
zh: 未找到 Pages 项目

# pages_lastDeployment
source: Last deployed: {date}
pt: Último deploy: {date}
zh: 上次部署：{date}

# pages_statusSuccess
source: Success
pt: Sucesso
zh: 成功

# pages_statusFailed
source: Failed
pt: Falhou
zh: 失败

# pages_statusBuilding
source: Building
pt: Construindo
zh: 构建中

# pages_statusQueued
source: Queued
pt: Na fila
zh: 排队中

# pages_statusSkipped
source: Skipped
pt: Pulado
zh: 已跳过

# pages_statusUnknown
source: Unknown
pt: Desconhecido
zh: 未知

# pages_openInBrowser
source: Open in browser
pt: Abrir no navegador
zh: 在浏览器中打开

# pages_deployments
source: Deployments
pt: Implantações
zh: 部署

# pages_noDeployments
source: No deployments found
pt: Nenhuma implantação encontrada
zh: 未找到部署

# pages_production
source: Production
pt: Produção
zh: 生产环境

# pages_preview
source: Preview
zh: 预览

# pages_deploymentDetails
source: Deployment Details
pt: Detalhes da Implantação
zh: 部署详情

# pages_commitInfo
source: Commit Information
pt: Informações do Commit
zh: 提交信息

# pages_buildStages
source: Build Stages
pt: Etapas do Build
zh: 构建阶段

# pages_rollback
source: Rollback
pt: Reverter
zh: 回滚

# pages_rollbackConfirmTitle
source: Rollback Deployment
pt: Reverter Implantação
zh: 回滚部署

# pages_rollbackConfirmMessage
source: Are you sure you want to rollback to this deployment? This will make this deployment the current production version.
pt: Tem certeza que deseja reverter para esta implantação? Ela se tornará a versão atual de produção.
zh: 确定要回滚到此部署吗？这会使该部署成为当前生产版本。

# pages_rollbackSuccess
source: Rollback successful
pt: Reversão concluída
zh: 回滚成功

# pages_retry
source: Retry
pt: Tentar novamente
zh: 重试

# pages_retryConfirmTitle
source: Retry Deployment
pt: Repetir Implantação
zh: 重试部署

# pages_retryConfirmMessage
source: Are you sure you want to retry this deployment? This will start a new build with the same configuration.
pt: Tem certeza que deseja repetir esta implantação? Isso iniciará um novo build.
zh: 确定要重试此部署吗？这将以相同配置启动新的构建。

# pages_retrySuccess
source: Deployment retry started
pt: Repetição iniciada
zh: 已开始重试部署

# pages_autoDeployPaused
source: Auto-deploy paused
pt: Auto-deploy pausado
zh: 自动部署已暂停

# pages_buildLogs
source: Build Logs
pt: Logs do Build
zh: 构建日志

# pages_noLogs
source: No logs available
pt: Nenhum log disponível
zh: 暂无日志

# pages_autoScrollOn
source: Auto-scroll enabled
pt: Auto-scroll ativado
zh: 自动滚动已开启

# pages_autoScrollOff
source: Auto-scroll disabled
pt: Auto-scroll desativado
zh: 自动滚动已关闭

# pages_logCount
source: {current} of {total} lines
pt: {current} de {total} linhas
zh: {current} / {total} 行

# pages_customDomains
source: Custom Domains
pt: Domínios Customizados
zh: 自定义域名

# pages_addDomain
source: Add Domain
pt: Adicionar Domínio
zh: 添加域名

# pages_deleteDomainConfirmTitle
source: Delete Custom Domain?
pt: Excluir Domínio Customizado?
zh: 删除自定义域名？

# pages_deleteDomainConfirmMessage
source: Are you sure you want to delete "{domain}"? This will disconnect it from your Pages project.
pt: Tem certeza que deseja excluir "{domain}"?
zh: 确定要删除“{domain}”吗？这将与您的 Pages 项目断开关联。

# pages_buildSettings
source: Build Settings
pt: Configurações de Build
zh: 构建设置

# pages_buildCommand
source: Build Command
pt: Comando de Build
zh: 构建命令

# pages_outputDirectory
source: Output Directory
pt: Diretório de Saída
zh: 输出目录

# pages_rootDirectory
source: Root Directory
pt: Diretório Raiz
zh: 根目录

# pages_environmentVariables
source: Environment Variables
pt: Variáveis de Ambiente
zh: 环境变量

# pages_productionEnv
source: Production Environment
pt: Ambiente de Produção
zh: 生产环境

# pages_previewEnv
source: Preview Environment
pt: Ambiente de Preview
zh: 预览环境

# pages_addVariable
source: Add Variable
pt: Adicionar Variável
zh: 添加变量

# pages_variableName
source: Name
pt: Nome
zh: 名称

# pages_variableValue
source: Value
pt: Valor
zh: 值

# pages_secret
source: Secret
zh: 密文

# pages_plainText
source: Plain Text
pt: Texto Simples
zh: 明文

# pages_compatibilityDate
source: Compatibility Date
pt: Data de Compatibilidade
zh: 兼容性日期

# pages_compatibilityFlags
source: Compatibility Flags
pt: Flags de Compatibilidade
zh: 兼容性标志

# pages_saveSettings
source: Save Settings
pt: Salvar Configurações
zh: 保存设置

# pages_settingsUpdated
source: Settings updated successfully
pt: Configurações atualizadas
zh: 设置更新成功

# pages_domainAdded
source: Domain added successfully
pt: Domínio adicionado
zh: 域名添加成功

# pages_domainDeleted
source: Domain deleted successfully
pt: Domínio excluído
zh: 域名删除成功

# pages_gitRepository
source: Git Repository
pt: Repositório Git
zh: Git 仓库

# pages_productionBranch
source: Production Branch
pt: Branch de Produção
zh: 生产分支

# pages_automaticDeployments
source: Preview Deployments
pt: Deployments de Preview
zh: 预览部署

# pages_automaticDeploymentsDescription
source: Automatic deployments for preview branches
pt: Implantações automáticas para branches de preview
zh: 为预览分支自动部署

# pages_productionDeployments
source: Production Deployments
pt: Deployments de Produção
zh: 生产部署

# pages_productionDeploymentsDescription
source: Automatic deployments for production branch
pt: Implantações automáticas para a branch de produção
zh: 为生产分支自动部署

# pages_prComments
source: PR Comments
pt: Comentários em PR
zh: PR 评论

# pages_buildSystemVersion
source: Build System Version
pt: Versão do Sistema de Build
zh: 构建系统版本

# pages_buildOutput
source: Build Output
pt: Saída do Build
zh: 构建输出

# pages_buildComments
source: Build Comments
pt: Comentários do Build
zh: 构建注释

# pages_buildCache
source: Build Cache
pt: Cache do Build
zh: 构建缓存

# pages_buildWatchPaths
source: Build Watch Paths
pt: Caminhos de Monitoramento
zh: 构建监视路径

# pages_includePaths
source: Include Paths
pt: Caminhos Incluídos
zh: 包含路径

# pages_deployHooks
source: Deploy Hooks
pt: Hooks de Deploy
zh: 部署钩子

# pages_noDeployHooks
source: No deploy hooks defined
pt: Nenhum hook de deploy definido
zh: 未定义部署钩子

# pages_runtime
source: Runtime
zh: 运行时

# pages_placement
source: Placement
zh: 部署位置

# pages_usageModel
source: Usage Model
pt: Modelo de Uso
zh: 计费模式

# pages_bindings
source: Bindings
zh: 绑定

# pages_addBinding
source: Add Binding
pt: Adicionar Binding
zh: 添加绑定

# pages_variableType
source: Type
pt: Tipo
zh: 类型

# pages_variableSecret
source: Secret
zh: 密文

# pages_variablePlainText
source: Plaintext
pt: Texto Simples
zh: 明文

source: Pages Functions billing
pt: Faturamento de Functions
zh: Pages Functions 计费

# pages_cpuTimeLimit
source: CPU time limit
pt: Limite de tempo de CPU
zh: CPU 时间限制

# pages_accessPolicy
source: Access policy
pt: Política de Acesso
zh: 访问策略

# pages_dangerZone
source: Danger Zone
pt: Zona de Perigo
zh: 危险区域

# pages_deleteProject
source: Delete Project
pt: Excluir Projeto
zh: 删除项目

# pages_deleteProjectDescription
source: Permanently delete this Pages project including all deployments, assets, functions and configurations associated with it.
pt: Excluir permanentemente este projeto Pages, incluindo todos os deployments, assets, funções e configurações associadas.
zh: 永久删除此 Pages 项目，包括所有部署、静态资源、函数和相关配置。

# pages_deleteProjectConfirmTitle
source: Delete Project?
pt: Excluir Projeto?
zh: 删除项目？

# pages_deleteProjectConfirmMessage
source: Are you sure you want to delete {project}? This action cannot be undone and will delete all deployments.
pt: Tem certeza que deseja excluir {project}? Esta ação não pode ser desfeita e excluirá todos os deployments.
zh: 确定要删除 {project} 吗？此操作无法撤销，并将删除所有部署。

# pages_projectDeleted
source: Project deleted successfully
pt: Projeto excluído com sucesso
zh: 项目删除成功

# workers_noWorkers
source: No Workers scripts found
pt: Nenhum script Workers encontrado
zh: 未找到 Workers 脚本

# workers_searchWorkers
source: Search Workers...
pt: Buscar Workers...
zh: 搜索 Workers...

# workers_lastModified
source: Last modified: {date}
pt: Modificado em: {date}
zh: 最后修改：{date}

# workers_tabs_overview
source: Overview
pt: Visão Geral
zh: 概览

# workers_tabs_triggers
source: Triggers
pt: Gatilhos
zh: 触发器

# workers_tabs_settings
source: Settings
pt: Configurações
zh: 设置

# workers_metrics_requests
source: Requests
pt: Requisições
zh: 请求

# workers_metrics_errors
source: Exceptions
pt: Exceções
zh: 异常

# workers_metrics_cpuTime
source: CPU Time
pt: Tempo de CPU
zh: CPU 时间

# workers_metrics_noData
source: No metrics available for this period
pt: Sem métricas disponíveis para este período
zh: 此期间无指标数据

# workers_triggers_customDomains
source: Custom Domains
pt: Domínios Customizados
zh: 自定义域名

# workers_triggers_routes
source: Routes
pt: Rotas
zh: 路由

# workers_triggers_addRoute
source: Add Route
pt: Adicionar Rota
zh: 添加路由

# workers_triggers_addDomain
source: Add Custom Domain
pt: Adicionar Domínio Customizado
zh: 添加自定义域名

# workers_triggers_routePattern
source: Route Pattern
pt: Padrão da Rota
zh: 路由模式

# workers_triggers_deleteRouteConfirm
source: Are you sure you want to delete this route?
pt: Tem certeza que deseja excluir esta rota?
zh: 确定要删除此路由吗？

# workers_triggers_deleteDomainConfirm
source: Are you sure you want to detach this custom domain?
pt: Tem certeza que deseja desconectar este domínio?
zh: 确定要解绑此自定义域名吗？

# workers_triggers_routeAdded
source: Route added successfully
pt: Rota adicionada com sucesso
zh: 路由添加成功

# workers_triggers_routeDeleted
source: Route deleted successfully
pt: Rota excluída com sucesso
zh: 路由删除成功

# workers_triggers_domainAdded
source: Domain attached successfully
pt: Domínio conectado com sucesso
zh: 域名绑定成功

# workers_triggers_domainDeleted
source: Domain detached successfully
pt: Domínio desconectado com sucesso
zh: 域名解绑成功

# workers_triggers_cron
source: Cron Triggers
zh: Cron 触发器

# workers_triggers_cronExpression
source: Cron Expression
pt: Expressão Cron
zh: Cron 表达式

# workers_triggers_cronFormat
source: Format: Minute Hour Day Month Weekday
pt: Formato: Minuto Hora Dia Mês DiaSemana
zh: 格式：分钟 小时 日 月 星期

# workers_triggers_deleteScheduleConfirm
source: Are you sure you want to remove this cron trigger?
pt: Tem certeza que deseja remover este cron trigger?
zh: 确定要移除此 cron 触发器吗？

# workers_triggers_noRoutes
source: No routes configured for this zone
pt: Nenhuma rota configurada para esta zona
zh: 此区域未配置路由

# workers_triggers_noSchedules
source: No cron triggers configured
pt: Nenhum cron trigger configurado
zh: 未配置 cron 触发器

# workers_triggers_domainManagedByCloudflare
source: Domain must be managed by Cloudflare.
pt: O domínio deve ser gerenciado pelo Cloudflare.
zh: 域名必须由 Cloudflare 管理。

# workers_triggers_zoneNotFound
source: Zone not found for this hostname.
pt: Zona não encontrada para este hostname.
zh: 未找到该主机名对应的区域。

# workers_settings_bindings
source: Bindings
zh: 绑定

# workers_settings_variables
source: Environment Variables
pt: Variáveis de Ambiente
zh: 环境变量

# workers_settings_compatibility
source: Compatibility
pt: Compatibilidade
zh: 兼容性

# workers_settings_usageModel
source: Usage Model
pt: Modelo de Uso
zh: 计费模式

# workers_bindings_kv
source: KV Namespace
pt: Namespace KV
zh: KV 命名空间

# workers_bindings_r2
source: R2 Bucket
pt: Bucket R2
zh: R2 存储桶

# workers_bindings_d1
source: D1 Database
pt: Banco de Dados D1
zh: D1 数据库

# workers_bindings_service
source: Service
pt: Serviço
zh: 服务

# workers_bindings_queue
source: Queue
pt: Fila
zh: 队列

# workers_settings_addBinding
source: Add Binding
pt: Adicionar Binding
zh: 添加绑定

# workers_settings_bindingType
source: Type
pt: Tipo
zh: 类型

# workers_settings_envVariable
source: Environment Variable
pt: Variável de Ambiente
zh: 环境变量

# workers_settings_bindingSecret
source: Secret
zh: 密文

# workers_settings_updateSecret
source: Update Secret
pt: Atualizar Secret
zh: 更新密文

# workers_settings_secretValue
source: Secret Value
pt: Valor do Secret
zh: 密文值

# workers_settings_secretHint
source: Enter secret value (write-only)
pt: Insira o valor do secret (somente escrita)
zh: 输入密文值（仅写入）

# workers_settings_observability
source: Observability
pt: Observabilidade
zh: 可观测性

# workers_settings_logs
source: Workers Logs
pt: Logs do Workers
zh: Workers 日志

# workers_settings_traces
source: Workers Traces
pt: Traces do Workers
zh: Workers 追踪

# workers_settings_tailDescription
source: Stream real-time logs from your Worker
pt: Transmitir logs em tempo real do seu Worker
zh: 实时流式查看 Worker 日志

# workers_settings_deleteWorker
source: Delete Worker
pt: Excluir Worker
zh: 删除 Worker

# workers_settings_deleteWorkerConfirm
source: Are you sure you want to delete this Worker? This action cannot be undone and will delete all files, configurations and deployments.
pt: Tem certeza que deseja excluir este Worker? Esta ação não pode ser desfeita e excluirá todos os arquivos, configurações e deployments.
zh: 确定要删除此 Worker 吗？此操作无法撤销，并将删除所有文件、配置和部署。

# workers_settings_domainsAndRoutes
source: Domains & Routes
pt: Domínios e Rotas
zh: 域名与路由

# workers_settings_build
source: Build
zh: 构建

# workers_settings_gitIntegration
source: Git Integration
pt: Integração Git
zh: Git 集成

# workers_settings_gitIntegrationDescription
source: Configure CI/CD in Cloudflare Dashboard
pt: Configurar CI/CD no Dashboard da Cloudflare
zh: 在 Cloudflare 控制台配置 CI/CD

# workers_settings_noAccountSelected
source: No account selected
pt: Nenhuma conta selecionada
zh: 未选择账号

# workers_tail_title
source: Worker Tail Logs
pt: Logs do Worker (Tail)
zh: Worker Tail 日志

# workers_tail_connected
source: Connected
pt: Conectado
zh: 已连接

# workers_tail_connecting
source: Connecting...
pt: Conectando...
zh: 连接中...

# workers_tail_disconnected
source: Disconnected
pt: Desconectado
zh: 已断开

# workers_tail_start
source: Start
pt: Iniciar
zh: 开始

# workers_tail_stop
source: Stop
pt: Parar
zh: 停止

# workers_tail_clear
source: Clear logs
pt: Limpar logs
zh: 清除日志

# workers_tail_autoScroll
source: Auto-scroll
zh: 自动滚动

# workers_tail_filterAll
source: All
pt: Todos
zh: 全部

# workers_tail_filterLog
source: Log
zh: 日志

# workers_tail_filterWarn
source: Warnings
pt: Avisos
zh: 警告

# workers_tail_filterError
source: Errors
pt: Erros
zh: 错误

# workers_tail_logCount
source: {count} logs
zh: {count} 条日志

# workers_tail_noLogsYet
source: No logs yet. Trigger your worker to see logs.
pt: Nenhum log ainda. Acione seu worker para ver logs.
zh: 暂无日志。触发您的 Worker 以查看日志。

# workers_tail_notConnected
source: Not connected. Click Start to begin tailing.
pt: Não conectado. Clique em Iniciar para começar.
zh: 未连接。点击开始以进行 Tail。

# workers_settings_viewDomains
source: View Domains
pt: Ver Domínios
zh: 查看域名

# workers_settings_viewRoutes
source: View Routes
pt: Ver Rotas
zh: 查看路由

# workers_settings_pricing
source: Pricing
pt: Preço
zh: 价格

# settings_languageEn
source: English
pt: Inglês

# pages_domainNameHint
source: example.com
pt: exemplo.com

# workers_triggers_routePatternHint
source: example.com/*
pt: exemplo.com/*
