Repository: verseles/dash-for-cloudflare
Catalog: lib/l10n/app_*.arb
Languages: pt, zh

# common_cancel
source: Cancel
pt: Cancelar
zh: 取消

# common_close
source: Close
pt: Fechar
zh: 关闭

# common_copied
source: Copied to clipboard
pt: Copiado para a área de transferência
zh: 已复制到剪贴板

# common_copy
source: Copy
pt: Copiar
zh: 复制

# common_copyFailed
source: Failed to copy
pt: Falha ao copiar
zh: 复制失败

# common_create
source: Create
pt: Criar
zh: 创建

# common_add
source: Add
pt: Adicionar
zh: 添加

# common_delete
source: Delete
pt: Excluir
zh: 删除

# common_deleted
source: Deleted successfully
pt: Excluído com sucesso
zh: 删除成功

# common_edit
source: Edit
pt: Editar
zh: 编辑

# common_error
source: Error
pt: Erro
zh: 错误

# common_loading
source: Loading...
pt: Carregando...
zh: 加载中...

# common_noData
source: No data available
pt: Nenhum dado disponível
zh: 暂无数据

# common_ok
source: OK
zh: 确定

# common_refresh
source: Refresh
pt: Atualizar
zh: 刷新

# common_retry
source: Retry
pt: Tentar novamente
zh: 重试

# common_save
source: Save
pt: Salvar
zh: 保存

# common_workInProgress
source: Work in progress. This feature will be available soon!
pt: Trabalho em andamento. Este recurso estará disponível em breve!
zh: 功能开发中，敬请期待！

# common_clearSearch
source: Clear search
pt: Limpar busca
zh: 清除搜索

# common_clearFilters
source: Clear filters
pt: Limpar filtros
zh: 清除筛选

# common_all
source: All
pt: Tudo
zh: 全部

# common_none
source: None
pt: Nenhum
zh: 无

# common_proxy
source: Proxy
zh: 代理

# common_rootOnly
source: Root only
pt: Apenas raiz
zh: 仅根域

# common_disable
source: Disable
pt: Desativar
zh: 禁用

# menu_analytics
source: Analytics
zh: 分析

# menu_settings
source: Settings
pt: Configurações
zh: 设置

# menu_about
source: About
pt: Sobre
zh: 关于

# menu_debugLogs
source: Debug Logs
pt: Logs de Depuração
zh: 调试日志

# menu_selectZone
source: Select Zone
pt: Selecionar Zona
zh: 选择区域

# menu_noZones
source: No zones
pt: Sem zonas
zh: 无区域

# tabs_records
source: Records
pt: Registros
zh: 记录

# tabs_analytics
source: Analytics
zh: 分析

# tabs_settings
source: Settings
pt: Configurações
zh: 设置

# tabs_security
source: Security
pt: Segurança
zh: 安全

# tabs_cache
source: Cache
zh: 缓存

# zone_selectZone
source: Select a zone
pt: Selecione uma zona
zh: 选择区域

# zone_searchZones
source: Search zones...
pt: Buscar zonas...
zh: 搜索区域...

# zone_noZones
source: No zones found
pt: Nenhuma zona encontrada
zh: 未找到区域

# zone_status_active
source: Active
pt: Ativo
zh: 已激活

# zone_status_pending
source: Pending
pt: Pendente
zh: 待处理

# zone_status_initializing
source: Initializing
pt: Inicializando
zh: 初始化中

# zone_status_moved
source: Moved
pt: Movido
zh: 已迁移

# zone_status_deleted
source: Deleted
pt: Excluído
zh: 已删除

# zone_status_deactivated
source: Deactivated
pt: Desativado
zh: 已停用

source: DNS Records
pt: Registros DNS
zh: DNS 记录

# dns_filterAll
source: All
pt: Tudo
zh: 全部

# dns_searchRecords
source: Search records...
pt: Buscar registros...
zh: 搜索记录...

# dns_noRecords
source: No DNS records
pt: Sem registros DNS
zh: 无 DNS 记录

# dns_noRecordsDescription
source: Add a DNS record to get started
pt: Adicione um registro DNS para começar
zh: 添加 DNS 记录以开始

# dns_noRecordsMatch
source: No records match your filter
pt: Nenhum registro corresponde ao filtro
zh: 没有匹配筛选条件的记录

# dns_selectZoneFirst
source: Select a zone to view records
pt: Selecione uma zona para ver os registros
zh: 请选择区域以查看记录

# dns_addRecord
source: Add Record
pt: Adicionar Registro
zh: 添加记录

# dns_editRecord
source: Edit Record
pt: Editar Registro
zh: 编辑记录

# dns_deleteRecord
source: Delete Record
pt: Excluir Registro
zh: 删除记录

# dns_deleteConfirmTitle
source: Delete DNS Record?
pt: Excluir Registro DNS?
zh: 删除 DNS 记录？

# dns_deleteConfirmMessage
source: Are you sure you want to delete {name}? This action cannot be undone.
pt: Tem certeza que deseja excluir {name}? Esta ação não pode ser desfeita.
zh: 确定要删除 {name} 吗？此操作无法撤销。

# dns_recordSaved
source: Record saved successfully
pt: Registro salvo com sucesso
zh: 记录保存成功

# dns_recordDeleted
source: Record deleted successfully
pt: Registro excluído com sucesso
zh: 记录删除成功

# dns_recordDeletedUndo
source: Record deleted. Tap to undo.
pt: Registro excluído. Toque para desfazer.
zh: 记录已删除。点击撤销。

# dns_deleteRecordConfirmTitle
source: Delete Record?
pt: Excluir Registro?
zh: 删除记录？

# dns_deleteRecordConfirmMessage
source: Are you sure you want to delete "{name}"?
pt: Tem certeza que deseja excluir "{name}"?
zh: 确定要删除“{name}”吗？

# record_type
source: Type
pt: Tipo
zh: 类型

# record_name
source: Name
pt: Nome
zh: 名称

# record_nameHint
source: Name or @ for root
pt: Nome ou @ para raiz
zh: 名称或 @ 为根域

# record_nameRequired
source: Name is required
pt: Nome é obrigatório
zh: 名称为必填

# record_content
source: Content
pt: Conteúdo
zh: 内容

# record_contentRequired
source: Content is required
pt: Conteúdo é obrigatório
zh: 内容为必填

# record_ttlAuto
source: Auto
zh: 自动

# record_priority
source: Priority
pt: Prioridade
zh: 优先级

# record_proxied
source: Proxied
pt: Com Proxy
zh: 已代理

# record_proxiedTooltip
source: Proxied through Cloudflare
pt: Trafégo passa pelo Cloudflare
zh: 通过 Cloudflare 代理

# record_dnsOnly
source: DNS only
pt: Apenas DNS
zh: 仅 DNS

# record_dnsOnlyTooltip
source: DNS only (not proxied)
pt: Apenas DNS (sem proxy)
zh: 仅 DNS（不代理）

# analytics_title
source: DNS Analytics
zh: DNS 分析

# analytics_selectZone
source: Select a zone to view analytics
pt: Selecione uma zona para ver o analytics
zh: 选择区域以查看分析

# analytics_noData
source: No analytics data
pt: Sem dados de analytics
zh: 无分析数据

# analytics_loadAnalytics
source: Load Analytics
pt: Carregar Analytics
zh: 加载分析

# analytics_totalQueries
source: Total Queries
pt: Total de Consultas
zh: 查询总数

# analytics_topQueryNames
source: Top Query Names
pt: Principais Nomes
zh: 热门查询名称

# analytics_clearSelection
source: Clear selection
pt: Limpar seleção
zh: 清除选择

# analytics_total
source: Total
zh: 总计

# analytics_queryTypes
source: Query Types
pt: Tipos de Consulta
zh: 查询类型

# analytics_dataCenters
source: Data Centers
zh: 数据中心

# analytics_queriesOverTime
source: Queries Over Time
pt: Consultas ao Longo do Tempo
zh: 随时间的查询

# analytics_queriesByDataCenter
source: Queries by Data Center
pt: Consultas por Data Center
zh: 按数据中心的查询

# analytics_queriesByLocation
source: Queries by Location
pt: Consultas por Localização
zh: 按位置的查询

# analytics_queriesByRecordType
source: Queries by Record Type
pt: Consultas por Tipo de Registro
zh: 按记录类型的查询

# analytics_queriesByResponseCode
source: Queries by Response Code
pt: Consultas por Código de Resposta
zh: 按响应代码的查询

# analytics_queriesByIpVersion
source: Queries by IP Version
pt: Consultas por Versão IP
zh: 按 IP 版本的查询

# analytics_queriesByProtocol
source: Queries by Protocol
pt: Consultas por Protocolo
zh: 按协议的查询

# analytics_topQueryNamesChart
source: Top Query Names
pt: Principais Nomes de Consulta
zh: 热门查询名称

# analytics_requests
source: Requests
pt: Requisições
zh: 请求

# analytics_bandwidth
source: Bandwidth
pt: Largura de Banda
zh: 带宽

# analytics_uniqueVisitors
source: Unique Visitors
pt: Visitantes Únicos
zh: 独立访客

# analytics_requestsByStatus
source: Requests by Status
pt: Requisições por Status
zh: 按状态的请求

# analytics_requestsByCountry
source: Requests by Country
pt: Requisições por País
zh: 按国家/地区的请求

# analytics_geographicDistribution
source: Geographic Distribution
pt: Distribuição Geográfica
zh: 地理分布

# analytics_requestsByProtocol
source: Requests by Protocol
pt: Requisições por Protocolo
zh: 按协议的请求

# analytics_requestsByHost
source: Requests by Host
pt: Requisições por Host
zh: 按主机的请求

# analytics_topPaths
source: Top Paths
pt: Principais Caminhos
zh: 热门路径

# analytics_threatsStopped
source: Threats Stopped
pt: Ameaças Detidas
zh: 已阻止的威胁

# analytics_totalThreatsBlocked
source: Total Threats Blocked
pt: Total de Ameaças Bloqueadas
zh: 被阻止的威胁总数

# analytics_actionsTaken
source: Actions Taken
pt: Ações Tomadas
zh: 采取的操作

# analytics_threatsByCountry
source: Threats by Country
pt: Ameaças por País
zh: 按国家/地区的威胁

# analytics_topThreatSources
source: Top Threat Sources
pt: Principais Fontes de Ameaça
zh: 主要威胁来源

# analytics_threatOrigins
source: Threat Origins
pt: Origens de Ameaça
zh: 威胁来源

# analytics_cacheHitRatio
source: Cache Hit Ratio
pt: Taxa de Cache
zh: 缓存命中率

# analytics_bandwidthSaved
source: Bandwidth Saved
pt: Banda Economizada
zh: 节省的带宽

# analytics_requestsCacheVsOrigin
source: Requests (Cache vs Origin)
pt: Requisições (Cache vs Origem)
zh: 请求（缓存 vs 源站）

# analytics_bandwidthCacheVsOrigin
source: Bandwidth (Cache vs Origin)
pt: Banda (Cache vs Origem)
zh: 带宽（缓存 vs 源站）

# analytics_cacheStatusByHttpStatus
source: Cache Status by HTTP Status
pt: Status de Cache por HTTP Status
zh: 按 HTTP 状态的缓存状态

# analytics_securityRequiresPaidPlan
source: Security Analytics requires a paid Cloudflare plan (Pro or higher).
pt: Security Analytics requer um plano pago do Cloudflare (Pro ou superior).
zh: 安全分析需要付费的 Cloudflare 计划（Pro 或更高）。

# dnsSettings_title
source: DNS Settings
pt: Configurações DNS
zh: DNS 设置

# dnsSettings_dnssecDescription
source: DNS Security Extensions adds a layer of security by signing DNS records. This helps protect your domain from DNS spoofing and cache poisoning attacks.
pt: Extensões de Segurança do DNS adicionam uma camada de segurança assinando registros DNS. Isso ajuda a proteger seu domínio contra ataques de falsificação de DNS.
zh: DNS 安全扩展通过对 DNS 记录进行签名增加安全层，帮助保护您的域名免受 DNS 欺骗和缓存投毒攻击。

# dnsSettings_dnssecDisabled
source: DNSSEC is disabled
pt: DNSSEC está desativado
zh: DNSSEC 已禁用

# dnsSettings_dnssecPending
source: DNSSEC is pending activation
pt: DNSSEC aguardando ativação
zh: DNSSEC 正在激活中

# dnsSettings_dnssecPendingCf
source: DNSSEC will be configured automatically by Cloudflare Registrar
pt: DNSSEC será configurado automaticamente pelo Cloudflare Registrar
zh: DNSSEC 将由 Cloudflare Registrar 自动配置

# dnsSettings_dnssecActive
source: DNSSEC is active
pt: DNSSEC está ativo
zh: DNSSEC 已启用

# dnsSettings_dnssecPendingDisable
source: DNSSEC is pending deactivation
pt: DNSSEC aguardando desativação
zh: DNSSEC 正在停用中

# dnsSettings_enableDnssec
source: Enable DNSSEC
pt: Ativar DNSSEC
zh: 启用 DNSSEC

# dnsSettings_disableDnssec
source: Disable DNSSEC
pt: Desativar DNSSEC
zh: 禁用 DNSSEC

# dnsSettings_cancelDnssec
source: Cancel
pt: Cancelar
zh: 取消

# dnsSettings_viewDetails
source: View Details
pt: Ver Detalhes
zh: 查看详情

# dnsSettings_viewDsRecord
source: View DS Record
pt: Ver Registro DS
zh: 查看 DS 记录

# dnsSettings_dsRecord
source: DS Record
pt: Registro DS
zh: DS 记录

# dnsSettings_copyDsRecord
source: Copy DS Record
pt: Copiar Registro DS
zh: 复制 DS 记录

# dnsSettings_dsRecordCopied
source: DS record copied to clipboard
pt: Registro DS copiado
zh: DS 记录已复制到剪贴板

# dnsSettings_addDsToRegistrar
source: Add this DS record to your domain registrar to complete DNSSEC setup:
pt: Adicione este registro DS ao seu registrador de domínio para concluir a configuração do DNSSEC:
zh: 将此 DS 记录添加到您的域名注册商以完成 DNSSEC 设置：

# dnsSettings_multiSignerDnssec
source: Multi-signer DNSSEC
pt: DNSSEC Multi-assinatário
zh: 多签名 DNSSEC

# dnsSettings_multiSignerDescription
source: Allows multiple DNS providers to sign your zone
pt: Permite que vários provedores de DNS assinem sua zona
zh: 允许多个 DNS 提供商为您的区域签名

# dnsSettings_multiProviderDns
source: Multi-provider DNS
pt: DNS Multi-provedor
zh: 多提供商 DNS

# dnsSettings_multiProviderDescription
source: Enable secondary DNS with other providers
pt: Ativar DNS secundário com outros provedores
zh: 启用其他提供商的辅助 DNS

# dnsSettings_cnameFlattening
source: CNAME Flattening
pt: Achatamento de CNAME
zh: CNAME 扁平化

# dnsSettings_cnameFlatteningDescription
source: Flatten CNAME records at the zone apex
pt: Achatar registros CNAME na raiz da zona (apex)
zh: 在区域顶点扁平化 CNAME 记录

# dnsSettings_cnameFlattenNone
source: None
pt: Nenhum
zh: 无

# dnsSettings_cnameFlattenAtRoot
source: Flatten at root
pt: Achatar na raiz
zh: 仅根域扁平化

# dnsSettings_cnameFlattenAll
source: Flatten all
pt: Achatar tudo
zh: 全部扁平化

# dnsSettings_emailSecurity
source: Email Security
pt: Segurança de E-mail
zh: 邮件安全

# dnsSettings_emailSecurityDescription
source: Configure DMARC, SPF, and DKIM records for email authentication
pt: Configurar registros DMARC, SPF e DKIM para autenticação de e-mail
zh: 配置 DMARC、SPF 和 DKIM 记录用于邮件认证

# dnsSettings_configureEmail
source: Configure
pt: Configurar
zh: 配置

# dnsSettings_disableDnssecTitle
source: Disable DNSSEC?
pt: Desativar DNSSEC?
zh: 禁用 DNSSEC？

# dnsSettings_cancelDeactivation
source: Cancel Deactivation
pt: Cancelar Desativação
zh: 取消停用

# emailSecurity_spfExists
source: SPF record already configured
pt: Registro SPF já configurado
zh: SPF 记录已配置

# emailSecurity_spfNotConfigured
source: SPF not configured
pt: SPF não configurado
zh: SPF 未配置

# emailSecurity_spfDescription
source: Sender Policy Framework (SPF) specifies which mail servers are authorized to send email on behalf of your domain.
pt: Sender Policy Framework (SPF) especifica quais servidores de e-mail estão autorizados a enviar e-mails em nome do seu domínio.
zh: 发件人策略框架（SPF）指定哪些邮件服务器有权代表您的域名发送邮件。

# emailSecurity_spfIncludes
source: Authorized Senders (includes)
pt: Remetentes Autorizados (includes)
zh: 授权发件人（includes）

# emailSecurity_spfIncludesHint
source: e.g., _spf.google.com sendgrid.net
pt: ex: _spf.google.com sendgrid.net
zh: 例如：_spf.google.com sendgrid.net

# emailSecurity_spfPolicy
source: Policy (All)
pt: Política (All)
zh: 策略（All）

# emailSecurity_spfPolicyHint
source: ~all (soft fail), -all (hard fail), or +all (allow)
pt: ~all (soft fail), -all (hard fail), ou +all (permitir)
zh: ~all（软失败）、-all（硬失败）或 +all（允许）

# emailSecurity_spfSaved
source: SPF record saved successfully
pt: Registro SPF salvo com sucesso
zh: SPF 记录保存成功

# emailSecurity_dkimExists
source: DKIM record already configured
pt: Registro DKIM já configurado
zh: DKIM 记录已配置

# emailSecurity_dkimNotConfigured
source: DKIM not configured
pt: DKIM não configurado
zh: DKIM 未配置

# emailSecurity_dkimDescription
source: DomainKeys Identified Mail (DKIM) adds a digital signature to your emails to verify they haven't been tampered with.
pt: DomainKeys Identified Mail (DKIM) adiciona uma assinatura digital aos seus e-mails para verificar que não foram adulterados.
zh: 域名密钥识别邮件（DKIM）为您的邮件添加数字签名，以验证其未被篡改。

# emailSecurity_dkimSelector
source: Selector
pt: Seletor
zh: 选择器

# emailSecurity_dkimSelectorHint
source: e.g., default, google, mailgun
pt: ex: default, google, mailgun
zh: 例如：default、google、mailgun

# emailSecurity_dkimPublicKey
source: Public Key (p=)
pt: Chave Pública (p=)
zh: 公钥（p=）

# emailSecurity_dkimPublicKeyHint
source: Paste the public key provided by your email provider (without v=DKIM1; k=rsa; p= prefix)
pt: Cole a chave pública fornecida pelo seu provedor de e-mail (sem o prefixo v=DKIM1; k=rsa; p=)
zh: 粘贴您的邮件提供商提供的公钥（不包含 v=DKIM1; k=rsa; p= 前缀）

# emailSecurity_dkimPublicKeyRequired
source: Public key is required
pt: Chave pública é obrigatória
zh: 公钥为必填

# emailSecurity_dkimSaved
source: DKIM record saved successfully
pt: Registro DKIM salvo com sucesso
zh: DKIM 记录保存成功

# emailSecurity_dmarcExists
source: DMARC record already configured
pt: Registro DMARC já configurado
zh: DMARC 记录已配置

# emailSecurity_dmarcNotConfigured
source: DMARC not configured
pt: DMARC não configurado
zh: DMARC 未配置

# emailSecurity_dmarcDescription
source: Domain-based Message Authentication, Reporting & Conformance (DMARC) tells receiving mail servers what to do when SPF or DKIM checks fail.
pt: Domain-based Message Authentication, Reporting & Conformance (DMARC) informa aos servidores de e-mail o que fazer quando as verificações SPF ou DKIM falharem.
zh: 域名消息认证、报告与一致性（DMARC）告知接收服务器当 SPF 或 DKIM 校验失败时如何处理。

# emailSecurity_dmarcPolicy
source: Policy
pt: Política
zh: 策略

# emailSecurity_dmarcPolicyHint
source: Action to take on authentication failure
pt: Ação a tomar em caso de falha de autenticação
zh: 认证失败时采取的操作

# emailSecurity_dmarcPolicyNone
source: None (Monitor only)
pt: Nenhuma (Apenas monitorar)
zh: 无（仅监控）

# emailSecurity_dmarcPolicyQuarantine
source: Quarantine (Mark as spam)
pt: Quarentena (Marcar como spam)
zh: 隔离（标记为垃圾邮件）

# emailSecurity_dmarcPolicyReject
source: Reject (Block delivery)
pt: Rejeitar (Bloquear entrega)
zh: 拒绝（阻止投递）

# emailSecurity_dmarcRua
source: Aggregate Reports Email (rua)
pt: E-mail para Relatórios Agregados (rua)
zh: 汇总报告邮箱（rua）

# emailSecurity_dmarcRuaHint
source: e.g., dmarc-reports@yourdomain.com
pt: ex: dmarc-reports@seudominio.com
zh: 例如：dmarc-reports@yourdomain.com

# emailSecurity_dmarcRuf
source: Forensic Reports Email (ruf)
pt: E-mail para Relatórios Forenses (ruf)
zh: 取证报告邮箱（ruf）

# emailSecurity_dmarcRufHint
source: Optional: forensic failure reports
pt: Opcional: relatórios forenses de falhas
zh: 可选：失败取证报告

# emailSecurity_dmarcPct
source: Percentage of emails to filter
pt: Percentual de e-mails a filtrar
zh: 过滤邮件的百分比

# emailSecurity_dmarcSaved
source: DMARC record saved successfully
pt: Registro DMARC salvo com sucesso
zh: DMARC 记录保存成功

# emailSecurity_preview
source: Preview
pt: Pré-visualização
zh: 预览

# emailSecurity_recordName
source: Record Name
pt: Nome do Registro
zh: 记录名称

# dnssecDetails_title
source: DNSSEC Details
pt: Detalhes DNSSEC
zh: DNSSEC 详情

# dnssecDetails_dsRecord
source: DS Record
pt: Registro DS
zh: DS 记录

# dnssecDetails_digest
source: Digest
zh: 摘要

# dnssecDetails_digestType
source: Digest Type
pt: Tipo de Digest
zh: 摘要类型

# dnssecDetails_algorithm
source: Algorithm
pt: Algoritmo
zh: 算法

# dnssecDetails_publicKey
source: Public Key
pt: Chave Pública
zh: 公钥

# dnssecDetails_keyTag
source: Key Tag
zh: 密钥标签

# dnssecDetails_keyType
source: Key Type
pt: Tipo de Chave
zh: 密钥类型

# dnssecDetails_flags
source: Flags
zh: 标志

# dnssecDetails_modifiedOn
source: Modified On
pt: Modificado em
zh: 修改时间

# dnssecDetails_tapToCopy
source: Tap to copy
pt: Toque para copiar
zh: 点击复制

# settings_title
source: Settings
pt: Configurações
zh: 设置

# settings_apiToken
source: API Token
pt: Token da API
zh: API 令牌

# settings_apiTokenHint
source: Enter your Cloudflare API token
pt: Insira seu Token da API Cloudflare
zh: 输入您的 Cloudflare API 令牌

# settings_apiTokenDescription
source: Your API token needs the following permissions:
pt: Seu token precisa das seguintes permissões:
zh: 您的 API 令牌需要以下权限：

# settings_apiTokenPermission1
source: Zone:Read - to list your zones
pt: Zone:Read - para listar suas zonas
zh: Zone:Read - 用于列出您的区域

# settings_apiTokenPermission2
source: DNS:Edit - to manage DNS records
pt: DNS:Edit - para gerenciar registros DNS
zh: DNS:Edit - 用于管理 DNS 记录

# settings_apiTokenPermission3
source: Zone Settings:Read - for DNSSEC status
pt: Zone Settings:Read - para status DNSSEC
zh: Zone Settings:Read - 用于 DNSSEC 状态

# settings_apiTokenPermission4
source: Zone Settings:Edit - to toggle DNSSEC
pt: Zone Settings:Edit - para alternar DNSSEC
zh: Zone Settings:Edit - 用于切换 DNSSEC

# settings_apiTokenPermission5
source: Analytics:Read - for DNS analytics
pt: Analytics:Read - para analytics DNS
zh: Analytics:Read - 用于 DNS 分析

# settings_createToken
source: Create a token at dash.cloudflare.com
pt: Crie um token em dash.cloudflare.com
zh: 在 dash.cloudflare.com 创建令牌

# settings_tokenValid
source: Token is valid
pt: Token válido
zh: 令牌有效

# settings_tokenInvalid
source: Token must be at least 40 characters
pt: Token deve ter pelo menos 40 caracteres
zh: 令牌至少需要 40 个字符

# settings_tokenSaved
source: Token saved
pt: Token salvo
zh: 令牌已保存

# settings_goToDns
source: Go to DNS
pt: Ir para DNS
zh: 前往 DNS

# settings_theme
source: Theme
pt: Tema
zh: 主题

# settings_themeLight
source: Light
pt: Claro
zh: 浅色

# settings_themeDark
source: Dark
pt: Escuro
zh: 深色

# settings_themeSystem
source: Auto
pt: Sistema
zh: 自动

# settings_amoledMode
source: AMOLED Black
zh: AMOLED 纯黑

# settings_amoledModeDescription
source: Pure black background for dark mode (saves battery on OLED screens)
pt: Fundo preto puro no modo escuro (economiza bateria em telas OLED)
zh: 暗色模式使用纯黑背景（在 OLED 屏幕上省电）

# settings_language
source: Language
pt: Idioma
zh: 语言

# settings_about
source: About
pt: Sobre
zh: 关于

# settings_version
source: Version {version}
pt: Versão {version}
zh: 版本 {version}

# error_generic
source: Something went wrong
pt: Algo deu errado
zh: 出现错误

# error_network
source: Network error. Please check your connection.
pt: Erro de rede. Verifique sua conexão.
zh: 网络错误，请检查您的连接。

# error_unauthorized
source: Invalid or expired API token
pt: Token de API inválido ou expirado
zh: API 令牌无效或已过期

# error_forbidden
source: You don't have permission to access this resource
pt: Você não tem permissão para acessar este recurso
zh: 您没有权限访问此资源

# error_notFound
source: Resource not found
pt: Recurso não encontrado
zh: 资源未找到

# error_rateLimited
source: Too many requests. Please try again later.
pt: Muitas requisições. Tente novamente mais tarde.
zh: 请求过多，请稍后再试。

# error_serverError
source: Server error. Please try again later.
pt: Erro no servidor. Tente novamente mais tarde.
zh: 服务器错误，请稍后再试。

# error_prefix
source: Error: {message}
pt: Erro: {message}
zh: 错误：{message}

# error_copyError
source: Copy Error Details
pt: Copiar Detalhes do Erro
zh: 复制错误详情

# error_permissionsRequired
source: Permissions Required
pt: Permissões Necessárias
zh: 需要权限

# error_permissionsDescription
source: Your API token doesn't have the necessary permissions to access this resource. Please check your token settings on Cloudflare.
pt: Seu token de API não tem as permissões necessárias. Verifique as configurações no painel da Cloudflare.
zh: 您的 API 令牌没有访问此资源所需的权限。请检查 Cloudflare 控制台中的令牌设置。

# error_checkCloudflareDashboard
source: Check Cloudflare Dashboard
pt: Verificar Painel Cloudflare
zh: 查看 Cloudflare 控制台

# error_commonPermissionsTitle
source: Commonly required permissions:
pt: Permissões comuns necessárias:
zh: 常见所需权限：

# pwa_updateAvailable
source: A new version is available
pt: Nova versão disponível
zh: 有新版本可用

# pwa_updateNow
source: Update Now
pt: Atualizar Agora
zh: 立即更新

# pwa_installApp
source: Install App
pt: Instalar App
zh: 安装应用

# pwa_installDescription
source: Install Dash for CF for quick access
pt: Instale o Dash for CF para acesso rápido
zh: 安装 Dash for CF 以便快速访问

# settings_cloudflareApiToken
source: Cloudflare API Token
pt: Token API Cloudflare
zh: Cloudflare API 令牌

# settings_requiredPermissions
source: Required permissions: Zone:Read, DNS:Read, DNS:Edit
pt: Permissões: Zone:Read, DNS:Read, DNS:Edit
zh: 所需权限：Zone:Read、DNS:Read、DNS:Edit

# settings_createTokenOnCloudflare
source: Create token on Cloudflare
pt: Criar token no Cloudflare
zh: 在 Cloudflare 创建令牌

# settings_tokenPastedFromClipboard
source: Token pasted from clipboard
pt: Token colado da área de transferência
zh: 已从剪贴板粘贴令牌

# settings_storage
source: Storage
pt: Armazenamento
zh: 存储

# settings_clearCache
source: Clear Cache
pt: Limpar Cache
zh: 清除缓存

# settings_clearCacheDescription
source: DNS records, analytics, and data centers
pt: Registros DNS, analytics e data centers
zh: DNS 记录、分析和数据中心

# settings_clearCacheTitle
source: Clear Cache
pt: Limpar Cache
zh: 清除缓存

# settings_clearCacheMessage
source: This will clear all cached data including DNS records, analytics, and data center information. Data will be reloaded from the API on next access.
pt: Isso limpará todos os dados em cache. Os dados serão recarregados da API no próximo acesso.
zh: 这将清除所有缓存数据，包括 DNS 记录、分析和数据中心信息。 下次访问时将从 API 重新加载数据。

# settings_cacheCleared
source: Cache cleared successfully
pt: Cache limpo com sucesso
zh: 缓存已清除

# settings_debug
source: Debug
pt: Depuração
zh: 调试

# settings_saveLogsToFile
source: Save logs to file
pt: Salvar logs em arquivo
zh: 保存日志到文件

# settings_saveLogsDescription
source: Persists logs for later analysis
pt: Mantém logs para análise posterior
zh: 保存日志以便之后分析

# settings_viewDebugLogs
source: View Debug Logs
pt: Ver Logs de Depuração
zh: 查看调试日志

# settings_goToDnsManagement
source: Go to DNS Management
pt: Gerenciar DNS
zh: 前往 DNS 管理
